## FUNGSI REPLACE

In [1]:
import pandas as pd
import numpy as np

__Mengganti data dengan fungsi replace menjadi NaN__

In [2]:
df = pd.read_csv("data.csv")
df = df.replace(["-", "#"], np.NaN)
df

   no  nama usia
0   1  Andi   21
1   2   NaN   22
2   3  Caca  NaN
3   4  Deni   24

In [3]:
df = df.fillna("XXX")
df

   no  nama usia
0   1  Andi   21
1   2   XXX   22
2   3  Caca  XXX
3   4  Deni   24

__Mengganti data berdasar karakter yang sudah didefinisikan__

In [4]:
df = pd.read_csv("data.csv")
df = df.replace({
    "-":"+",
    "#":np.NaN
})
df

   no  nama usia
0   1  Andi   21
1   2   NaN   22
2   3  Caca    +
3   4  Deni   24

__Mengganti data berdasarkan nama kolom__

In [5]:
df = pd.read_csv("data.csv")
df = df.replace({
    "usia":["-","#"]}, np.NaN)
df

   no  nama usia
0   1  Andi   21
1   2     #   22
2   3  Caca  NaN
3   4  Deni   24

Tanda "#" di kolom nama tidak ikut berubah

In [6]:
df = pd.read_csv("data.csv")
df = df.replace({
    "usia":["-","#"], "nama":"#"},{
    "usia": np.NaN,
    "nama": "Anonim"
})
df

   no    nama usia
0   1    Andi   21
1   2  Anonim   22
2   3    Caca  NaN
3   4    Deni   24

In [7]:
df = pd.read_csv("data.csv")
df["usia"] = df["usia"].replace(
to_replace= "-",
method= "ffill")
df

   no  nama usia
0   1  Andi   21
1   2     #   22
2   3  Caca   22
3   4  Deni   24

In [8]:
df = pd.read_csv("data.csv")
df["usia"] = df["usia"].replace(
to_replace= "-",
method= "bfill")
df

   no  nama usia
0   1  Andi   21
1   2     #   22
2   3  Caca   24
3   4  Deni   24